app/controllers/movies_controller.rb

  def update
    @movie = Movie.find(params[:id])
    if @movie.update(movie_params)
---
SELECT  "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "movies" SET "duration" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["duration", "100 min"], ["updated_at", 2017-01-08 19:15:50 UTC], ["id", 5]]