app/controllers/reviews_controller.rb

	def create

  		@review = @movie.reviews.new(review_params)
  	if  @review.save
---
INSERT INTO "reviews" ("name", "stars", "comment", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)